# Pandas Exercises

## Setup and Importing

### 1. Import Libraries

Before you begin you should import the two main data manipulation libraries for Python.

Note: Be sure to use their common aliases

In [1]:
import numpy as np
import pandas as pd

### 2. Importing from different sources

In the following blocks you will create a pandas dataframe and you will save that dataframe to a variable named ```df```. After each import, you should use another Pandas function to view your dataframe to ensure that it was imported correctly.

#### Import and view from CSV

In [2]:
df_csv = pd.read_csv("data/payers.csv")
df_csv.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,NaN,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,NaN,46005.43

#### Import and view from Excel

In [3]:
df_xlsx = pd.read_excel("data/payers.xlsx")
df_xlsx.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.840,2015-12-22 21:19:23.417,NaT,NaN,0,Card,NaN
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205,NaT,NaT,NaN,0,Card,NaN
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.949,2016-01-05 22:54:01.211,NaT,NaN,0,Card,NaN
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.954,2016-01-14 19:05:16.639,NaT,NaN,0,Card,NaN
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.846,2016-01-26 23:25:43.269,NaT,NaN,0,Card,NaN

#### Import and view from JSON

In [4]:
df_json = pd.read_json("data/payers.json")
df_json.head()

,address,bill_day,company_name,created_at,deleted_at,email,id,intacct_id,name,notes,source,updated_at
0,None,0,Weissnat Group,2015-12-21 17:00:25.839697,NaT,constantin@example.net,1038,None,Parisian,NaN,Card,2015-12-22 21:19:23.416702
1,None,0,Bogisich and Bogisich Group,2016-02-12 00:52:30.205216,NaT,susana@example.org,1178,None,Cormier,NaN,Card,NaT
2,None,0,Schultz and Hane and Sons,2015-07-01 22:19:34.948958,NaT,bailey@example.org,45,None,Hilpert,NaN,Card,2016-01-05 22:54:01.211366
3,None,0,Lowe and Raynor Group,2016-01-13 20:00:45.953792,NaT,torey@example.com,1084,None,Olson,NaN,Card,2016-01-14 19:05:16.638872
4,None,0,Dooley and Schumm Group,2016-01-12 20:22:40.846050,NaT,felicia@example.org,1077,None,Pfannerstill,NaN,Card,2016-01-26 23:25:43.269280

### 3. Different ways to preview dataset

There are three main methods in python to get a quick preview of your dataset. One method views the top rows, another method views the bottom rows, and the final method views a random sample of rows. Please re-import the CSV file as ```df``` and demonstrate all three methods.

In [5]:
df = pd.read_csv("data/payers.csv")
df_copy = df.copy()

#### View top rows

In [6]:
df_copy.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,NaN,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,NaN,46005.43

#### View bottom rows

In [7]:
df_copy.tail()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
4329,4396,mable@example.net,Macejkovic and Terry and Sons,Koepp,NaN,2019-11-11 17:24:02.740492,2019-11-11 18:14:07.35787,NaN,NaN,0,StripeACH,NaN,5163.52
4330,4338,amely@example.org,Bahringer and Willms and Sons,Windler,NaN,2019-09-23 20:43:18.840344,2019-11-11 18:19:56.855298,NaN,NaN,0,Card,NaN,43291.75
4331,4398,aron@example.org,Hettinger and Sons,Gulgowski,NaN,2019-11-13 17:57:42.630953,2019-11-20 14:07:00.968375,NaN,NaN,0,Card,NaN,38760.29
4332,4381,thurman@example.com,Bernhard Inc,Bailey,NaN,2019-10-24 22:23:44.647668,2019-12-09 20:01:10.594901,NaN,NaN,0,Card,NaN,45314.00
4333,4403,meda@example.net,Bauch and Schmidt and Sons,Bernhard,NaN,2019-12-27 22:52:03.629465,2020-01-07 19:30:57.121667,NaN,NaN,0,Card,NaN,28621.20

#### View random rows

In [8]:
df_copy.sample()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
3646,3714,kelton@example.net,Schimmel and Veum Inc,Parisian,NaN,2018-08-02 23:11:01.689321,2018-08-10 22:34:36.246312,NaN,NaN,0,Card,NaN,48598.91

How would you change the number or rows that are being viewed in each of these methods? Below, view a random sample of 20 rows.

#### View 10 random rows

In [9]:
df_copy.sample(10)

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
1328,1401,dejuan@example.org,Von and Marks LLC,Walsh,NaN,2016-05-13 22:28:08.484536,2016-06-07 21:20:31.982992,NaN,C-01478,0,Card,NaN,48084.14
2745,2858,doyle@example.net,Mitchell and Marquardt and Sons,Frami,NaN,2017-08-02 17:47:10.603749,2017-08-08 18:26:07.933776,NaN,NaN,0,Card,NaN,41263.88
4056,4133,ross@example.org,Lebsack and Sons,Jacobson,NaN,2019-04-19 22:37:04.961045,2019-04-22 20:44:07.150062,NaN,NaN,0,Card,NaN,43803.97
4286,4364,pauline@example.com,DuBuque and Morar LLC,Jakubowski,NaN,2019-10-15 18:08:55.357932,2020-02-29 23:42:06.355536,NaN,NaN,0,Card,NaN,24133.68
2076,2159,carey@example.com,Langosh and Rippin and Sons,Padberg,NaN,2017-01-20 17:20:55.465742,2018-06-11 20:22:55.914704,NaN,NaN,0,Card,NaN,35327.51
1434,1511,aisha@example.org,Rowe and Bruen Inc,Pfeffer,NaN,2016-06-30 20:37:28.297325,NaN,NaN,NaN,0,Card,NaN,8870.24
460,1134,zachary@example.org,Connelly and Sons,Jenkins,NaN,2016-01-29 21:21:58.659816,2016-02-02 00:29:43.222048,NaN,NaN,0,Card,NaN,48844.28
886,413,corene@example.net,Schuster and Effertz LLC,Smitham,NaN,2015-08-18 17:00:52.642091,NaN,NaN,NaN,0,Card,NaN,44985.33
4074,4116,antonina@example.net,Borer and Thompson LLC,Stroman,NaN,2019-04-05 19:46:25.044387,2019-05-24 18:28:02.203776,NaN,NaN,0,Card,NaN,3271.05
3115,3196,corbin@example.net,Hackett and Mayert and Sons,Sauer,NaN,2017-12-15 22:55:58.484253,2017-12-16 00:35:44.957498,NaN,NaN,0,Card,NaN,19761.22

#### View 20 random rows

In [10]:
df_copy.sample(20)

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
1992,2106,rebecca@example.net,Hoppe Inc,Jacobi,NaN,2017-01-11 13:32:32.990153,2017-01-16 23:16:03.832221,NaN,NaN,0,Card,NaN,6045.60
2072,2168,jeanie@example.org,Armstrong and Sons,Parker,NaN,2017-01-20 21:52:55.767842,NaN,NaN,NaN,0,Card,NaN,5695.47
2139,2200,earnest@example.com,Rath and O'Kon LLC,Beier,NaN,2017-01-31 00:27:09.871115,2017-02-13 23:58:50.281276,NaN,NaN,0,Card,NaN,48610.47
1356,1431,joy@example.com,Lynch Inc,Ritchie,NaN,2016-05-27 20:39:08.817649,2016-05-27 22:30:13.052092,NaN,NaN,0,Card,NaN,8842.25
4165,4113,jacey@example.com,Bruen and Ryan Group,Hodkiewicz,NaN,2019-04-02 20:33:30.44019,2019-06-24 19:00:05.350688,NaN,NaN,0,Card,NaN,46505.89
537,422,colt@example.net,Hoeger and Heller LLC,Hickle,NaN,2015-08-25 19:52:46.03607,2015-11-23 22:40:16.905018,NaN,NaN,0,Card,NaN,40201.22
1157,760,raven@example.org,Monahan and Conn and Sons,Wisoky,NaN,2015-09-14 18:32:22.682081,NaN,NaN,NaN,0,Card,NaN,44942.69
69,625,jerad@example.com,Grimes and Sons,Swift,NaN,2015-09-14 18:32:22.682081,2015-11-23 22:40:16.052966,NaN,NaN,0,Card,NaN,11973.33
2746,2831,vladimir@example.org,Marks Inc,Kutch,NaN,2017-07-28 22:14:21.687456,2017-07-29 00:25:06.437013,NaN,NaN,0,Card,NaN,6194.85
1893,1971,oscar@example.net,Kirlin and Reinger LLC,Pouros,NaN,2016-12-01 14:42:43.250596,2016-12-01 23:57:43.023674,NaN,NaN,0,Card,NaN,35333.00
252,439,grace@example.org,Maggio Inc,Bailey,NaN,2015-08-25 19:52:46.03607,2015-11-23 22:40:17.123248,NaN,NaN,0,Card,NaN,44257.65
2788,2853,scarlett@example.org,Terry and Bahringer Inc,Luettgen,NaN,2017-08-02 13:33:51.289749,2018-01-31 19:22:48.533243,NaN,NaN,0,Card,NaN,3770.50
2871,2961,alan@example.com,Steuber Inc,Purdy,NaN,2017-09-15 22:02:24.291697,2017-09-22 19:58:41.960409,NaN,NaN,0,Card,"Peawork, Inc.\n10 Canal Park\nCambridge, MA 02141",5873.67
784,1011,velda@example.org,Baumbach Group,Ankunding,NaN,2015-12-03 19:42:51.656904,2015-12-22 21:20:55.325495,NaN,NaN,0,Card,NaN,7660.31
2201,2210,lempi@example.com,Konopelski and Schumm Group,Robel,NaN,2017-02-02 17:16:11.101516,2018-05-02 04:33:04.146038,NaN,NaN,0,StripeACH,NaN,37374.20
2714,2795,maida@example.org,Beier and Leuschke and Sons,Bahringer,NaN,2017-07-19 20:10:12.045736,2017-07-24 17:39:44.870597,NaN,NaN,0,Card,NaN,9943.39
1159,765,elenor@example.org,Cruickshank and Marquardt Group,Kutch,NaN,2015-09-14 18:32:22.682081,NaN,NaN,NaN,0,Card,NaN,33655.79
3285,3355,kieran@example.net,Walker Inc,Hahn,NaN,2018-02-26 19:35:12.95023,2018-02-27 17:19:30.482039,NaN,NaN,0,Card,NaN,20443.12
2735,2849,matt@example.com,Lindgren and Carter Group,Ziemann,NaN,2017-08-01 04:52:51.578746,2018-06-06 16:38:25.666564,NaN,NaN,0,Card,NaN,8718.26
3836,3894,hadley@example.com,Wiegand and Morissette LLC,Gottlieb,NaN,2018-11-15 20:13:19.371005,2019-06-06 01:28:39.537649,NaN,NaN,0,Card,NaN,13057.31

#### View the number or rows and columns in your dataset

In [11]:
df_copy.shape

(4334, 13)

#### Get basic info about your dataset

In [53]:
df_copy.describe()

                id  notes     bill_day      bill_amt
count  4334.000000    0.0  4334.000000   4334.000000
mean   2223.665436    NaN     0.035072  25557.751387
std    1267.603220    NaN     0.724225  14167.505568
min       1.000000    NaN    -1.000000   1004.320000
25%    1138.250000    NaN     0.000000  13217.625000
50%    2227.500000    NaN     0.000000  25226.240000
75%    3319.750000    NaN     0.000000  38148.070000
max    4404.000000    NaN    15.000000  49999.940000

### 3. Simple selecting from a DataFrame

Once you have properly imported your data and you are going to start selecting and transforming it, you should create a copy so you can refer to your untransformed data later.

Note: It can sometimes

#### Create a copy of your original dataframe called df_copy

Remember that you can use both **.loc** and **.iloc** to access either rows or columns in a dataframe.

#### Select the 50th row in df_copy

Remember: Python and Pandas both start counting at 0, so the very first row is row index 0. The tenth row is at row index 9. For example ```df_copy.loc[0:9]``` will return 10 rows and ```df_copy.loc[0:10]``` will return 11 rows.

In [31]:
df_copy.loc[49]

id                                       2
email                  felicia@example.net
company_name                   Thiel Group
name                              Gislason
notes                                  NaN
created_at      2015-07-01 22:19:34.948958
updated_at      2018-10-30 22:20:04.839051
deleted_at                             NaN
intacct_id                             NaN
bill_day                                 0
source                                Card
address                                NaN
bill_amt                           7156.82
Name: 49, dtype: object

#### Select the 50th row index in df_copy

In [32]:
df_copy.loc[50]

id                                    1105
email                    riley@example.net
company_name      Gerlach and Walter Group
name                             O'Connell
notes                                  NaN
created_at      2016-01-19 21:19:36.722309
updated_at      2017-07-10 16:29:05.673215
deleted_at                             NaN
intacct_id                             NaN
bill_day                                 0
source                                Card
address                                NaN
bill_amt                          27157.76
Name: 50, dtype: object

#### Select the row index 100 - 110

In [33]:
df_copy.loc[100:110]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
99,472,phoebe@example.net,Hirthe and Sons,Borer,NaN,2015-08-31 22:14:16.482632,2016-11-17 17:59:42.580941,NaN,NaN,0,Card,NaN,27318.59
100,610,harry@example.org,Larkin and Sawayn LLC,Lueilwitz,NaN,2015-09-14 18:32:22.682081,2016-09-22 04:24:16.140126,NaN,NaN,0,Card,NaN,26004.88
101,365,adriel@example.net,Wisoky and Leannon Inc,Kohler,NaN,2015-07-20 18:14:26.457837,2016-09-23 04:49:07.476228,NaN,C-00827,0,Card,NaN,48129.01
102,485,belle@example.org,Bauch and Schamberger and Sons,Goldner,NaN,2015-09-08 19:30:31.50149,2017-03-16 15:42:44.10449,NaN,NaN,0,Card,NaN,23657.26
103,616,asha@example.net,Ryan and Robel and Sons,Mraz,NaN,2015-09-14 18:32:22.682081,2019-06-19 19:16:58.634643,NaN,NaN,0,Card,NaN,4580.78
104,475,jacinthe@example.org,Bogan and Rolfson LLC,Weber,NaN,2015-08-31 22:14:16.482632,2016-12-09 16:44:45.463862,NaN,NaN,0,Card,NaN,1728.49
105,448,peter@example.com,Murray and Kuhlman and Sons,Bednar,NaN,2015-08-25 19:52:46.03607,2017-01-31 10:13:37.944792,NaN,NaN,0,Card,NaN,19790.86
106,874,brycen@example.org,Stanton and Feil and Sons,Farrell,NaN,2015-10-07 16:20:38.385503,2017-12-02 05:28:11.795008,NaN,NaN,0,Card,NaN,20258.65
107,813,wendell@example.net,Spinka and Wiza and Sons,Lind,NaN,2015-09-18 16:08:32.796709,2019-04-11 18:14:05.239068,NaN,NaN,0,Card,NaN,23423.54
108,1123,isom@example.net,Nikolaus and Berge Group,Prosacco,NaN,2016-01-26 18:45:01.041246,2019-03-15 21:17:57.921214,NaN,NaN,0,ACH,NaN,12973.68

#### Select the row index for rows 35, 55, 75, and 95

In [36]:
df_copy.loc[[35, 55, 75, 95]]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
35,1282,ferne@example.net,Lemke LLC,Bashirian,NaN,2016-03-23 19:06:12.008668,NaN,NaN,NaN,0,Card,NaN,17859.62
55,1065,alvera@example.org,Aufderhar and Jenkins Group,Wisoky,NaN,2016-01-05 22:54:11.550182,2016-01-26 17:32:33.786991,NaN,NaN,0,Card,NaN,33011.34
75,496,rhianna@example.org,Fisher and Mraz Group,Cremin,NaN,2015-09-12 17:21:04.603626,2015-11-23 22:40:17.968251,NaN,NaN,0,Card,NaN,44221.87
95,980,jovany@example.com,Wunsch and Ebert Group,Hills,NaN,2015-11-17 23:46:27.979538,2015-11-24 22:56:16.467175,NaN,NaN,0,Card,NaN,1490.55

#### Select only the "email" column from the dataframe

In [38]:
df_copy["email"]

0       constantin@example.net
1           susana@example.org
2           bailey@example.org
3            torey@example.com
4          felicia@example.org
                 ...
4329         mable@example.net
4330         amely@example.org
4331          aron@example.org
4332       thurman@example.com
4333          meda@example.net
Name: email, Length: 4334, dtype: object

#### Select column "id" through column "name"

In [39]:
df_copy.loc[:,"id":"name"]

,id,email,company_name,name
0,1038,constantin@example.net,Weissnat Group,Parisian
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert
3,1084,torey@example.com,Lowe and Raynor Group,Olson
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill
...,...,...,...,...
4329,4396,mable@example.net,Macejkovic and Terry and Sons,Koepp
4330,4338,amely@example.org,Bahringer and Willms and Sons,Windler
4331,4398,aron@example.org,Hettinger and Sons,Gulgowski
4332,4381,thurman@example.com,Bernhard Inc,Bailey
4333,4403,meda@example.net,Bauch and Schmidt and Sons,Bernhard

#### Select all rows from the columns "email", "name", and "bill_amt"

In [40]:
df_copy.loc[:, ["email", "name", "bill_amt"]]

                       email          name  bill_amt
0     constantin@example.net      Parisian  40185.76
1         susana@example.org       Cormier  24870.32
2         bailey@example.org       Hilpert  11669.36
3          torey@example.com         Olson  35833.24
4        felicia@example.org  Pfannerstill  46005.43
...                      ...           ...       ...
4329       mable@example.net         Koepp   5163.52
4330       amely@example.org       Windler  43291.75
4331        aron@example.org     Gulgowski  38760.29
4332     thurman@example.com        Bailey  45314.00
4333        meda@example.net      Bernhard  28621.20

[4334 rows x 3 columns]

#### Select row indexes 10, 15, 21, and 71 with only the columns "id", "name",  and "source"

In [48]:
df_copy.loc[[10, 15, 21, 71], ["id", "name", "source"]]

      id      name source
10  1170   Rolfson   Card
15   602  Schiller   Card
21     6    Rogahn   Card
71   255      West   Card

### 4. Conditional selection

#### Create a boolean mask for "bill_amt" less than 35000

In [16]:
df_copy["bill_amt"] < 35000

0       False
1        True
2        True
3       False
4       False
        ...
4329     True
4330    False
4331    False
4332    False
4333     True
Name: bill_amt, Length: 4334, dtype: bool

#### Use boolean mask to get those rows which have "bill_amt" less than 3500

In [17]:
df_copy[df_copy["bill_amt"] < 35000]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,NaN,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
5,574,woodrow@example.com,Kirlin and Sons,Price,NaN,2015-09-14 18:32:22.682081,2016-01-29 17:20:47.232437,NaN,C-00055,0,Card,NaN,34187.06
6,1226,eladio@example.org,Reichel LLC,Walter,NaN,2016-03-03 18:33:16.885632,2016-03-09 19:30:11.386455,NaN,NaN,0,Card,NaN,23488.89
7,1144,shannon@example.com,Zulauf and Tromp Inc,Schuster,NaN,2016-02-04 17:20:57.156785,2016-02-11 18:58:30.167176,NaN,NaN,0,ACH,NaN,13627.18
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4323,4401,leslie@example.com,Blick Inc,Parisian,NaN,2019-11-18 17:44:09.768776,NaN,NaN,NaN,0,Card,NaN,11301.48
4326,4393,khalil@example.net,Erdman Group,Haag,NaN,2019-11-05 20:07:52.516689,2019-11-05 20:15:25.737042,NaN,NaN,0,Card,NaN,14053.30
4328,4372,letitia@example.org,Rowe and Sons,Wolff,NaN,2019-10-22 17:18:32.032963,2020-04-02 23:17:55.273883,NaN,NaN,0,Card,NaN,3925.64
4329,4396,mable@example.net,Macejkovic and Terry and Sons,Koepp,NaN,2019-11-11 17:24:02.740492,2019-11-11 18:14:07.35787,NaN,NaN,0,StripeACH,NaN,5163.52
4333,4403,meda@example.net,Bauch and Schmidt and Sons,Bernhard,NaN,2019-12-27 22:52:03.629465,2020-01-07 19:30:57.121667,NaN,NaN,0,Card,NaN,28621.20

#### Find rows with the column "name" equal to "Price"

In [18]:
df_copy[df_copy["name"] == "Price"]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
5,574,woodrow@example.com,Kirlin and Sons,Price,NaN,2015-09-14 18:32:22.682081,2016-01-29 17:20:47.232437,NaN,C-00055,0,Card,NaN,34187.06
33,578,althea@example.com,Stehr and Sons,Price,NaN,2015-09-14 18:32:22.682081,2016-03-04 08:30:10.059792,NaN,NaN,0,Card,NaN,2235.98
140,1270,maude@example.com,Keebler Group,Price,NaN,2016-03-16 18:14:51.237674,2016-03-16 20:31:25.852801,NaN,NaN,0,Card,NaN,1378.41
465,380,oscar@example.net,Hilpert and Fadel Group,Price,NaN,2015-07-20 18:14:26.457837,2015-11-23 22:40:14.601536,NaN,NaN,0,Card,NaN,21125.18
990,220,ladarius@example.net,Nolan and Harber Group,Price,NaN,2015-07-01 22:19:34.948958,NaN,NaN,NaN,0,Card,NaN,18852.51
1286,1357,barbara@example.org,Ebert and Vandervort LLC,Price,NaN,2016-04-27 15:54:02.234109,2017-08-24 10:16:44.149274,NaN,NaN,0,StripeACH,NaN,8679.67
2445,2538,ola@example.com,Jakubowski Inc,Price,NaN,2017-05-01 23:58:00.817618,NaN,NaN,NaN,0,Card,NaN,37686.91
3154,3241,floyd@example.com,Simonis Inc,Price,NaN,2018-01-16 18:20:15.674259,2018-08-29 17:34:36.738418,NaN,NaN,0,Card,NaN,2737.24
3446,3429,julian@example.net,Corwin and Aufderhar Inc,Price,NaN,2018-03-27 16:31:51.061198,2018-05-01 19:10:26.257185,NaN,NaN,0,Card,NaN,6557.86

#### Find rows where the "update_at" column is before 2018

In [20]:
df_copy[df_copy["updated_at"] < "2018"]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,NaN,46005.43
5,574,woodrow@example.com,Kirlin and Sons,Price,NaN,2015-09-14 18:32:22.682081,2016-01-29 17:20:47.232437,NaN,C-00055,0,Card,NaN,34187.06
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3120,2380,alaina@example.org,Sanford and Grimes and Sons,Ullrich,NaN,2017-03-15 18:40:44.216499,2017-12-20 18:13:11.042439,NaN,NaN,0,Card,NaN,35563.09
3122,3200,fatima@example.org,Bergstrom and Vandervort and Sons,Kulas,NaN,2017-12-20 01:18:53.416321,2017-12-20 20:49:28.498213,NaN,NaN,0,Card,NaN,4399.50
3125,3202,cordia@example.org,Bayer and Gutkowski Group,Ankunding,NaN,2017-12-26 02:06:44.973423,2017-12-26 22:39:57.289622,NaN,NaN,0,Card,NaN,15537.39
3128,3203,calista@example.org,Funk and Okuneva and Sons,Hackett,NaN,2017-12-27 18:25:20.112115,2017-12-27 18:44:30.855417,NaN,NaN,0,Card,NaN,27057.37
3131,3208,norbert@example.net,Turner and Sons,O'Kon,NaN,2017-12-29 18:11:46.261402,2017-12-29 18:45:43.715382,NaN,NaN,0,Card,NaN,48823.09

#### Select the rows where the "name" column is "Hackett" and the "bill_amt" is greater than 25000

In [23]:
df_copy[(df_copy["name"] == "Hackett") & (df_copy["bill_amt"] > 25000)]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
467,342,destiny@example.org,Wilderman and Gutmann Group,Hackett,NaN,2015-07-01 22:19:34.948958,2015-11-23 22:40:14.82539,NaN,NaN,0,Card,NaN,34206.49
1197,1036,filomena@example.com,Hackett LLC,Hackett,NaN,2015-12-17 19:27:49.687774,2016-01-26 23:09:49.544815,NaN,NaN,0,Card,NaN,49101.48
1885,1968,ena@example.org,Crist Group,Hackett,NaN,2016-11-30 13:27:05.706326,2017-03-03 23:03:02.816556,NaN,NaN,0,Card,NaN,42043.39
3128,3203,calista@example.org,Funk and Okuneva and Sons,Hackett,NaN,2017-12-27 18:25:20.112115,2017-12-27 18:44:30.855417,NaN,NaN,0,Card,NaN,27057.37
3300,3377,roberto@example.net,Wilkinson and Sons,Hackett,NaN,2018-03-05 21:27:28.998816,2018-03-06 19:58:19.822635,NaN,NaN,0,Card,NaN,41641.81
3631,3782,rowan@example.net,Nolan and Herzog LLC,Hackett,NaN,2018-09-08 16:49:34.537627,NaN,NaN,NaN,0,Card,NaN,40683.06

### 5. Transforming a DataFrame

Note: After transforming a DataFrame it is good practice to display the transformed DataFrame to ensure that the expected changes were made. This can be done by viewing the top rows of the DataFrame or by checking specific rows that you are concerned with.

#### View the top rows before making any changes

In [24]:
df_copy.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,NaN,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,NaN,46005.43

#### Drop the "address" column from your DataFrame and check your results

In [26]:
df_copy.drop("address", axis=1, inplace=True)
df_copy.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,46005.43

#### Drop all columns with Nan values

In [27]:
df_copy.dropna(axis=1, inplace=True)
df_copy.head()

,id,email,company_name,name,created_at,bill_day,source,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,2015-12-21 17:00:25.839697,0,Card,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,2016-02-12 00:52:30.205216,0,Card,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,2015-07-01 22:19:34.948958,0,Card,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,2016-01-13 20:00:45.953792,0,Card,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,2016-01-12 20:22:40.84605,0,Card,46005.43

#### Create a new column named "original_account" filled with the value "yes"

In [28]:
df_copy["original_account"] = "yes"
df_copy.head()

,id,email,company_name,name,created_at,bill_day,source,bill_amt,original_accounts
0,1038,constantin@example.net,Weissnat Group,Parisian,2015-12-21 17:00:25.839697,0,Card,40185.76,yes
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,2016-02-12 00:52:30.205216,0,Card,24870.32,yes
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,2015-07-01 22:19:34.948958,0,Card,11669.36,yes
3,1084,torey@example.com,Lowe and Raynor Group,Olson,2016-01-13 20:00:45.953792,0,Card,35833.24,yes
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,2016-01-12 20:22:40.84605,0,Card,46005.43,yes

#### Add 10000 to the "bill_amt" for all rows

In [29]:
df_copy["bill_amt"] = df_copy["bill_amt"] + 10000
df_copy.head()

,id,email,company_name,name,created_at,bill_day,source,bill_amt,original_accounts
0,1038,constantin@example.net,Weissnat Group,Parisian,2015-12-21 17:00:25.839697,0,Card,50185.76,yes
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,2016-02-12 00:52:30.205216,0,Card,34870.32,yes
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,2015-07-01 22:19:34.948958,0,Card,21669.36,yes
3,1084,torey@example.com,Lowe and Raynor Group,Olson,2016-01-13 20:00:45.953792,0,Card,45833.24,yes
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,2016-01-12 20:22:40.84605,0,Card,56005.43,yes

### 6. Save you DataFrame to a new CSV file in your data folder called "clean_payers.csv"

In [31]:
df_copy.to_csv("data/clean_payers.csv")

#### Check that "clean_payers.csv" was properly saved to your computer